---------------------------------소금(1)----------------------------------------

INSERT INTO FACE (FACE_CODE, FACE_NAME) 
VALUES (1, '소금');

---------------------------------간장(2)----------------------------------------

INSERT INTO FACE (FACE_CODE, FACE_NAME) 
VALUES (2, '간장');

---------------------------------마요네즈(3)----------------------------------------
INSERT INTO FACE (FACE_CODE, FACE_NAME) 
VALUES (3, '마요네즈');

---------------------------------된장(4)----------------------------------------
INSERT INTO FACE (FACE_CODE, FACE_NAME) 
VALUES (4, '된장');


